zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70144.atdf
        <module name="AES" id="6149" version="W">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
            </parameters>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="S">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA08" function="B" group="ADTRG"/>
              <signal pad="PD30" function="X1" group="AD" index="0"/>
              <signal pad="PA21" function="X1" group="AD" index="1"/>
              <signal pad="PB03" function="X1" group="AD" index="2"/>
              <signal pad="PE05" function="X1" group="AD" index="3"/>
              <signal pad="PE04" function="X1" group="AD" index="4"/>
              <signal pad="PB02" function="X1" group="AD" index="5"/>
              <signal pad="PA17" function="X1" group="AD" index="6"/>
              <signal pad="PA18" function="X1" group="AD" index="7"/>
              <signal pad="PA19" function="X1" group="AD" index="8"/>
              <signal pad="PA20" function="X1" group="AD" index="9"/>
              <signal pad="PB00" function="X1" group="AD" index="10"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="35"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
              <param caption="External ADC Trigger Input (AFE0_ADTRG pin)" name="TRGSEL_AFEC_TRIG0" value="0x0"/>
              <param caption="TC0 Channel 0 Output (TIOA0)" name="TRGSEL_AFEC_TRIG1" value="0x1"/>
              <param caption="TC0 Channel 1 Output (TIOA1)" name="TRGSEL_AFEC_TRIG2" value="0x2"/>
              <param caption="TC0 Channel 2 Output (TIOA2)" name="TRGSEL_AFEC_TRIG3" value="0x3"/>
              <param caption="PWM0 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
              <param caption="PWM0 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
              <param caption="Analog Comparator Fault Output" name="TRGSEL_AFEC_TRIG6" value="0x6"/>
              <param caption="Temperature Sensor Channel" name="TEMP_SENSOR_CH_NUM" value="11"/>
            </parameters>
          </instance>
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD09" function="C" group="ADTRG"/>
              <signal pad="PB01" function="X1" group="AD" index="0"/>
              <signal pad="PC13" function="X1" group="AD" index="1"/>
              <signal pad="PC15" function="X1" group="AD" index="2"/>
              <signal pad="PC12" function="X1" group="AD" index="3"/>
              <signal pad="PC29" function="X1" group="AD" index="4"/>
              <signal pad="PC30" function="X1" group="AD" index="5"/>
              <signal pad="PC31" function="X1" group="AD" index="6"/>
              <signal pad="PC26" function="X1" group="AD" index="7"/>
              <signal pad="PC27" function="X1" group="AD" index="8"/>
              <signal pad="PC00" function="X1" group="AD" index="9"/>
              <signal pad="PE03" function="X1" group="AD" index="10"/>
              <signal pad="PE00" function="X1" group="AD" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
              <param caption="External ADC Trigger Input (AFE1_ADTRG Pin)" name="TRGSEL_AFEC_TRIG0" value="0x0"/>
              <param caption="TC1 Channel 0 Output (TIOA3)" name="TRGSEL_AFEC_TRIG1" value="0x1"/>
              <param caption="TC1 Channel 1 Output (TIOA4)" name="TRGSEL_AFEC_TRIG2" value="0x2"/>
              <param caption="TC1 Channel 2 Output (TIOA5)" name="TRGSEL_AFEC_TRIG3" value="0x3"/>
              <param caption="PWM1 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
              <param caption="PWM1 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
              <param caption="Analog Comparator Fault Output" name="TRGSEL_AFEC_TRIG6" value="0x6"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZK">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="E">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD00" function="X1" group="DAC" index="1"/>
              <signal pad="PA02" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_CH0_TX" value="30"/>
              <param name="DMAC_ID_CH1_TX" value="31"/>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EBI">
          <instance name="EBI">
            <signals>
              <!-- reference: Table 33-1.EBI I/O Lines Description of DS60001527A -->
              <!-- EBI signals -->
              <signal pad="PC18" function="A" group="A" index="0"/>
              <signal pad="PC19" function="A" group="A" index="1"/>
              <signal pad="PC20" function="A" group="A" index="2"/>
              <signal pad="PC21" function="A" group="A" index="3"/>
              <signal pad="PC22" function="A" group="A" index="4"/>
              <signal pad="PC23" function="A" group="A" index="5"/>
              <signal pad="PC24" function="A" group="A" index="6"/>
              <signal pad="PC25" function="A" group="A" index="7"/>
              <signal pad="PC26" function="A" group="A" index="8"/>
              <signal pad="PC27" function="A" group="A" index="9"/>
              <signal pad="PC28" function="A" group="A" index="10"/>
              <signal pad="PC29" function="A" group="A" index="11"/>
              <signal pad="PC30" function="A" group="A" index="12"/>
              <signal pad="PC31" function="A" group="A" index="13"/>
              <signal pad="PA18" function="C" group="A" index="14"/>
              <signal pad="PA19" function="C" group="A" index="15"/>
              <signal pad="PA20" function="C" group="A" index="16"/>
              <signal pad="PA00" function="C" group="A" index="17"/>
              <signal pad="PA01" function="C" group="A" index="18"/>
              <signal pad="PA23" function="C" group="A" index="19"/>
              <signal pad="PA24" function="C" group="A" index="20"/>
              <signal pad="PC16" function="A" group="A" index="21"/>
              <signal pad="PC17" function="A" group="A" index="22"/>
              <signal pad="PA25" function="C" group="A" index="23"/>
              <signal pad="PC00" function="A" group="D" index="0"/>
              <signal pad="PC01" function="A" group="D" index="1"/>
              <signal pad="PC02" function="A" group="D" index="2"/>
              <signal pad="PC03" function="A" group="D" index="3"/>
              <signal pad="PC04" function="A" group="D" index="4"/>
              <signal pad="PC05" function="A" group="D" index="5"/>
              <signal pad="PC06" function="A" group="D" index="6"/>
              <signal pad="PC07" function="A" group="D" index="7"/>
              <signal pad="PE00" function="A" group="D" index="8"/>
              <signal pad="PE01" function="A" group="D" index="9"/>
              <signal pad="PE02" function="A" group="D" index="10"/>
              <signal pad="PE03" function="A" group="D" index="11"/>
              <signal pad="PE04" function="A" group="D" index="12"/>
              <signal pad="PE05" function="A" group="D" index="13"/>
              <signal pad="PA15" function="A" group="D" index="14"/>
              <signal pad="PA16" function="A" group="D" index="15"/>
              <signal pad="PC13" function="A" group="NWAIT"/>
              <!-- SMC signals -->
              <signal pad="PC14" function="A" group="NCS" index="0"/>
              <signal pad="PC15" function="A" group="NCS" index="1"/>
              <signal pad="PD18" function="A" group="NCS" index="1"/>
              <signal pad="PA22" function="C" group="NCS" index="2"/>
              <signal pad="PC12" function="A" group="NCS" index="3"/>
              <signal pad="PD19" function="A" group="NCS" index="3"/>
              <signal pad="PC08" function="A" group="NWR" index="0"/>
              <signal pad="PD15" function="C" group="NWR" index="1"/>
              <signal pad="PC11" function="A" group="NRD"/>
              <signal pad="PC08" function="A" group="NWE"/>
              <signal pad="PC18" function="A" group="NBS" index="0"/>
              <signal pad="PD15" function="C" group="NBS" index="1"/>
              <!-- EBI for NAND Flash Support signals -->
              <signal pad="PC16" function="A" group="NANDALE"/>
              <signal pad="PC17" function="A" group="NANDCLE"/>
              <signal pad="PC09" function="A" group="NANDOE"/>
              <signal pad="PC10" function="A" group="NANDWE"/>
            </signals>
          </instance>
        </module>
        <module name="EFC" id="6450" version="Y">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <signals>
              <signal pad="PB12" function="X1" group="ERASE"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="2097152"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" id="11046" version="S">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40050000"/>
            <signals>
              <signal pad="PD13" function="A" group="GCOL"/>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD08" function="A" group="GMDC"/>
              <signal pad="PD09" function="A" group="GMDIO"/>
              <signal pad="PD14" function="A" group="GRXCK"/>
              <signal pad="PD04" function="A" group="GRXDV"/>
              <signal pad="PD07" function="A" group="GRXER"/>
              <signal pad="PD05" function="A" group="GRX" index="0"/>
              <signal pad="PD06" function="A" group="GRX" index="1"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PB01" function="B" group="GTSUCOMP"/>
              <signal pad="PB12" function="B" group="GTSUCOMP"/>
              <signal pad="PD11" function="C" group="GTSUCOMP"/>
              <signal pad="PD20" function="C" group="GTSUCOMP"/>
              <signal pad="PD00" function="A" group="GTXCK"/>
              <signal pad="PD01" function="A" group="GTXEN"/>
              <signal pad="PD17" function="A" group="GTXER"/>
              <signal pad="PD02" function="A" group="GTX" index="0"/>
              <signal pad="PD03" function="A" group="GTX" index="1"/>
              <signal pad="PD15" function="A" group="GTX" index="2"/>
              <signal pad="PD16" function="A" group="GTX" index="3"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="39"/>
              <param name="CLOCK_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="J">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
