zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70144.atdf
          <instance name="TWIHS2">
            <register-group address-space="base" name="TWIHS2" name-in-module="TWIHS" offset="0x40060000"/>
            <signals>
              <signal pad="PD28" function="C" group="TWCK" index="2"/>
              <signal pad="PD27" function="C" group="TWD" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="19"/>
              <param name="DMAC_ID_TX" value="18"/>
              <param name="INSTANCE_ID" value="41"/>
              <param name="CLOCK_ID" value="41"/>
            </parameters>
          </instance>
        </module>
        <module name="UART" id="6418" version="R">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PA09" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="21"/>
              <param name="DMAC_ID_TX" value="20"/>
              <param name="INSTANCE_ID" value="7"/>
              <param name="CLOCK_ID" value="7"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_PMC_PCK" value="0" caption="PCK4"/>
            </parameters>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x400E0A00"/>
            <signals>
              <signal pad="PA05" function="C" group="URXD" index="1"/>
              <signal pad="PA04" function="C" group="UTXD" index="1"/>
              <signal pad="PA06" function="C" group="UTXD" index="1"/>
              <signal pad="PD26" function="D" group="UTXD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="23"/>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="INSTANCE_ID" value="8"/>
              <param name="CLOCK_ID" value="8"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_PMC_PCK" value="0" caption="PCK4"/>
            </parameters>
          </instance>
          <instance name="UART2">
            <register-group address-space="base" name="UART2" name-in-module="UART" offset="0x400E1A00"/>
            <signals>
              <signal pad="PD25" function="C" group="URXD" index="2"/>
              <signal pad="PD26" function="C" group="UTXD" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="25"/>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="INSTANCE_ID" value="44"/>
              <param name="CLOCK_ID" value="44"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_PMC_PCK" value="0" caption="PCK4"/>
            </parameters>
          </instance>
          <instance name="UART3">
            <register-group address-space="base" name="UART3" name-in-module="UART" offset="0x400E1C00"/>
            <signals>
              <signal pad="PD28" function="A" group="URXD" index="3"/>
              <signal pad="PD30" function="A" group="UTXD" index="3"/>
              <signal pad="PD31" function="B" group="UTXD" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="27"/>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="INSTANCE_ID" value="45"/>
              <param name="CLOCK_ID" value="45"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_PMC_PCK" value="0" caption="PCK4"/>
            </parameters>
          </instance>
          <instance name="UART4">
            <register-group address-space="base" name="UART4" name-in-module="UART" offset="0x400E1E00"/>
            <signals>
              <signal pad="PD18" function="C" group="URXD" index="4"/>
              <signal pad="PD03" function="C" group="UTXD" index="4"/>
              <signal pad="PD19" function="C" group="UTXD" index="4"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="29"/>
              <param name="DMAC_ID_TX" value="28"/>
              <param name="INSTANCE_ID" value="46"/>
              <param name="CLOCK_ID" value="46"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_PMC_PCK" value="0" caption="PCK4"/>
            </parameters>
          </instance>
        </module>
        <module name="USART" id="6089" version="ZW">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PB02" function="C" group="CTS" index="0"/>
              <signal pad="PD00" function="D" group="DCD" index="0"/>
              <signal pad="PD02" function="D" group="DSR" index="0"/>
              <signal pad="PD01" function="D" group="DTR" index="0"/>
              <signal pad="PD03" function="D" group="RI" index="0"/>
              <signal pad="PB03" function="C" group="RTS" index="0"/>
              <signal pad="PB00" function="C" group="RXD" index="0"/>
              <signal pad="PB13" function="C" group="SCK" index="0"/>
              <signal pad="PB01" function="C" group="TXD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="INSTANCE_ID" value="13"/>
              <param name="CLOCK_ID" value="13"/>
              <param name="USCLKS_MCK" value="0" caption="MCK"/>
              <param name="USCLKS_DIV" value="1" caption="MCK/8"/>
              <param name="USCLKS_PCK" value="2" caption="PCK4"/>
              <param name="USCLKS_SCK" value="3" caption="SCK"/>
            </parameters>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40028000"/>
            <signals>
              <signal pad="PA25" function="A" group="CTS" index="1"/>
              <signal pad="PA26" function="A" group="DCD" index="1"/>
              <signal pad="PA28" function="A" group="DSR" index="1"/>
              <signal pad="PA27" function="A" group="DTR" index="1"/>
              <signal pad="PA03" function="B" group="LONCOL" index="1"/>
              <signal pad="PA29" function="A" group="RI" index="1"/>
              <signal pad="PA24" function="A" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA23" function="A" group="SCK" index="1"/>
              <signal pad="PB04" function="D" group="TXD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
              <param name="USCLKS_MCK" value="0" caption="MCK"/>
              <param name="USCLKS_DIV" value="1" caption="MCK/8"/>
              <param name="USCLKS_PCK" value="2" caption="PCK4"/>
              <param name="USCLKS_SCK" value="3" caption="SCK"/>
            </parameters>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x4002C000"/>
            <signals>
              <signal pad="PD19" function="B" group="CTS" index="2"/>
              <signal pad="PD04" function="D" group="DCD" index="2"/>
              <signal pad="PD06" function="D" group="DSR" index="2"/>
              <signal pad="PD05" function="D" group="DTR" index="2"/>
              <signal pad="PD07" function="D" group="RI" index="2"/>
              <signal pad="PD18" function="B" group="RTS" index="2"/>
              <signal pad="PD15" function="B" group="RXD" index="2"/>
              <signal pad="PD17" function="B" group="SCK" index="2"/>
              <signal pad="PD16" function="B" group="TXD" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="DMAC_ID_TX" value="11"/>
              <param name="INSTANCE_ID" value="15"/>
              <param name="CLOCK_ID" value="15"/>
              <param name="USCLKS_MCK" value="0" caption="MCK"/>
              <param name="USCLKS_DIV" value="1" caption="MCK/8"/>
              <param name="USCLKS_PCK" value="2" caption="PCK4"/>
              <param name="USCLKS_SCK" value="3" caption="SCK"/>
            </parameters>
          </instance>
        </module>
