zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70144.atdf
        <register caption="SMC Mode Register" name="SMC_MODE" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT" values="SMC_MODE0__BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE0__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE0__PS"/>
        </register>
      </register-group>
      <register-group name="SMC">
        <register-group caption="SMC Setup Register" offset="0x0" name="SMC_CS_NUMBER" size="16" count="4" name-in-module="SMC_CS_NUMBER"/>
        <register caption="SMC Off-Chip Memory Scrambling Register" name="SMC_OCMS" offset="0x80" rw="RW" size="4">
          <bitfield caption="Static Memory Controller Scrambling Enable" mask="0x00000001" name="SMSE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00000100" name="CS0SE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00000200" name="CS1SE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00000400" name="CS2SE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00000800" name="CS3SE"/>
        </register>
        <register caption="SMC Off-Chip Memory Scrambling KEY1 Register" name="SMC_KEY1" offset="0x84" rw="W" size="4">
          <bitfield caption="Off-Chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="SMC Off-Chip Memory Scrambling KEY2 Register" name="SMC_KEY2" offset="0x88" rw="W" size="4">
          <bitfield caption="Off-Chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="SMC Write Protection Mode Register" name="SMC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SMC_WPMR__WPKEY"/>
        </register>
        <register caption="SMC Write Protection Status Register" name="SMC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="SMC_MODE0__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
