zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70144.atdf
        <register offset="0x00000014" size="4" name="MVFR1" initval="0x11000011" rw="R" caption="Media and VFP Feature Register 1">
          <bitfield mask="0x0000000F" name="FtZ_mode" caption="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
          <bitfield mask="0x000000F0" name="D_NaN_mode" caption="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
          <bitfield mask="0x0F000000" name="FP_HPFP" caption="Floating Point Half-Precision and double-precision"/>
          <bitfield mask="0xF0000000" name="FP_fused_MAC" caption="Indicates whether the FP supports fused multiply accumulate operations"/>
        </register>
        <register offset="0x00000018" size="4" name="MVFR2" initval="0x00000040" rw="R" caption="Media and VFP Feature Register 2">
          <bitfield mask="0x000000F0" name="VFP_Misc" caption="Indicates the hardware support for FP miscellaneous features"/>
        </register>
      </register-group>
    </module>
    <module name="ITM" caption="Instrumentation Trace Macrocell">
      <register-group name="ITM" caption="Instrumentation Trace Macrocell">
        <register name="PORT" offset="0x0" rw="W" size="4" access-size="4" count="32" caption="ITM Stimulus Port Registers">
          <mode name="BYTE"/>
          <mode name="HWORD"/>
          <mode name="WORD"/>
          <bitfield modes="BYTE" name="PORT" caption="" mask="0xFF"/>
          <bitfield modes="HWORD" name="PORT" caption="" mask="0xFFFF"/>
          <bitfield modes="WORD" name="PORT" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="TER" offset="0xE00" rw="RW" size="4" access-size="4" caption="ITM Trace Enable Register">
        </register>
        <register name="TPR" offset="0xE40" rw="RW" size="4" access-size="4" caption="ITM Trace Privilege Register">
          <bitfield name="PRIVMASK" caption="" mask="0xF"/>
        </register>
        <register name="TCR" offset="0xE80" rw="RW" size="4" access-size="4" caption="ITM Trace Control Register">
          <bitfield name="ITMENA" caption="" mask="0x1"/>
          <bitfield name="TSENA" caption="" mask="0x2"/>
          <bitfield name="SYNCENA" caption="" mask="0x4"/>
          <bitfield name="DWTENA" caption="" mask="0x8"/>
          <bitfield name="SWOENA" caption="" mask="0x10"/>
          <bitfield name="STALLENA" caption="" mask="0x20"/>
          <bitfield name="TSPrescale" caption="" mask="0x300"/>
          <bitfield name="GTSFREQ" caption="" mask="0xC00"/>
          <bitfield name="TraceBusID" caption="" mask="0x7F0000"/>
          <bitfield name="BUSY" caption="" mask="0x800000"/>
        </register>
      </register-group>
    </module>
    <module name="DWT" caption="Data Watchpoint and Trace Register">
      <register-group name="DWT" caption="Data Watchpoint and Trace Register">
        <register name="CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Control Register">
          <bitfield name="CYCCNTENA" caption="" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="" mask="0x400000"/>
          <bitfield name="NOPRFCNT" caption="" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="" mask="0xF0000000"/>
        </register>
        <register name="CYCCNT" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cycle Count Register">
        </register>
        <register name="CPICNT" offset="0x8" rw="RW" size="4" access-size="4" caption="CPI Count Register">
          <bitfield name="CPICNT" caption="" mask="0xFF"/>
        </register>
        <register name="EXCCNT" offset="0xC" rw="RW" size="4" access-size="4" caption="Exception Overhead Count Register">
          <bitfield name="EXCCNT" caption="" mask="0xFF"/>
        </register>
        <register name="SLEEPCNT" offset="0x10" rw="RW" size="4" access-size="4" caption="Sleep Count Register">
          <bitfield name="SLEEPCNT" caption="" mask="0xFF"/>
        </register>
        <register name="LSUCNT" offset="0x14" rw="RW" size="4" access-size="4" caption="LSU Count Register">
          <bitfield name="LSUCNT" caption="" mask="0xFF"/>
        </register>
        <register name="FOLDCNT" offset="0x18" rw="RW" size="4" access-size="4" caption="Folded-instruction Count Register">
          <bitfield name="FOLDCNT" caption="" mask="0xFF"/>
        </register>
        <register name="PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="Program Counter Sample Register">
        </register>
        <register name="COMP0" offset="0x20" rw="RW" size="4" access-size="4" caption="Comparator Register 0">
        </register>
        <register name="MASK0" offset="0x24" rw="RW" size="4" access-size="4" caption="Mask Register 0">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION0" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Function Register 0">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP1" offset="0x30" rw="RW" size="4" access-size="4" caption="Comparator Register 1">
        </register>
        <register name="MASK1" offset="0x34" rw="RW" size="4" access-size="4" caption="Mask Register 1">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
